Copyright
2016
IBM
Corp
Licensed
under
the
Apache
License
Version
2
0
you
may
not
use
this
file
except
in
compliance
with
You
obtain
a
copy
of
at
http
www
apache
org
licenses
LICENSE
Unless
required
by
applicable
law
or
agreed
to
writing
software
distributed
is
on
an
AS
IS
BASIS
WITHOUT
WARRANTIES
OR
CONDITIONS
OF
ANY
KIND
either
express
implied
See
for
specific
language
governing
permissions
and
limitations
XCLI
Client
Events
Module
module
client
Description
sending
notification
event
Spectrum
Accelerate
storage
arrays
import
json
from
socket
getfqdn
bunch
Bunch
logging
getLogger
pyxcli
XCLI_DEFAULT_LOGGER
i
events
platform_info
get_platform_details
errors
UnrecognizedCommandError
OperationForbiddenForUserCategoryError
log
css_product_event
class
EventsManager
object
Handle
CSS
XIV
def
__init__
self
xcli
product_name
product_version
init
Args
XCLIClient
send
string
product
s
name
version
Raises
ValueError
if
missing
server_name
platform
verify
params
raise
empty
staticmethod
_get_description_prefix
return
send_event
action
properties
event_severity
fails
custom_event
instead
ACTIONS
causing
dict
additional
severity
XCLIError
cmd
failed
KeyError
wasn
t
predefined
TypeError
None
event_properties
else
type
prepare
Product
Server
Platform
Action
Properties
event_description
dumps
use_custom_event
True
dir
try
css
debug
description
server
False
warning
custom
xml
1
encoding
UTF
8
project
xmlns
maven
POM
4
xsi
w3
2001
XMLSchema
instance
schemaLocation
xsd
modelVersion
parent
artifactId
og
groupId
com
ibm
Object
creation
management
components
dependencies
dependency
api
util
bin
bash
ne
then
echo
e
Usage
id
exit
fi
CAT_API_URL
wsk
list
tail
awk
print
5
curl
X
DELETE
SDWebImageManager
h
objc
message
interface
SDWebImageCombinedOperation
NSObject
SDWebImageOperation
property
assign
nonatomic
getter
isCancelled
BOOL
cancelled
SDWebImageNoParamsBlock
cancelBlock
strong
NSOperation
cacheOperation
end
readwrite
SDImageCache
imageCache
SDWebImageDownloader
imageDownloader
NSMutableSet
failedURLs
NSMutableArray
runningOperations
implementation
sharedManager
static
dispatch_once_t
once
dispatch_once
new
instancetype
cache
sharedImageCache
downloader
initWithCache
super
NSString
cacheKeyForURL
NSURL
url
absoluteString
key
imageFromMemoryCacheForKey
nil
YES
diskImageExistsWithKey
void
completion
SDWebImageCheckCacheCompletionBlock
completionBlock
making
sure
we
call
block
main
queue
dispatch_async
dispatch_get_main_queue
isInDiskCache
always
called
no
need
further
dispatch
downloadImageWithURL
options
SDWebImageOptions
progress
SDWebImageDownloaderProgressBlock
progressBlock
completed
completedBlock
Invoking
method
without
NSAssert
If
image
prefetchURLs
common
URL
using
For
some
reason
won
throw
any
mismatch
Here
failsafe
error
URLs
be
passed
as
isKindOfClass
app
argument
like
__block
operation
__weak
weakOperation
isFailedUrl
NO
synchronized
containsObject
length
dispatch_main_sync_safe
NSError
errorWithDomain
code
userInfo
SDImageCacheTypeNone
addObject
done
UIImage
SDImageCacheType
cacheType
removeObject
SDWebImageRefreshCached
delegate
respondsToSelector
selector
imageManager
was
found
c
ache
but
provided
notify
about
cached
AND
re
download
it
order
let
NSURLCache
refresh
requested
anyway
allowed
SDWebImageDownloaderOptions
downloaderOptions
SDWebImageDownloaderProgressiveDownload
force
off
already
ignore
read
downloadedImage
NSData
data
finished
__strong
__typeof
strongOperation
Do
nothing
more
details
would
there
could
race
condition
between
another
same
so
one
second
will
overwrite
cacheOnDisk
Image
do
images
transformedImage
imageWasTransformed
isEqual
storeImage
recalculateFromImage
imageData
forKey
toDisk
cancel
forURL
NSArray
copiedOperations
isRunning
count
check
just
_cancelBlock
don
forget
otherwise
get
crashes
TODO
temporary
fix
Until
can
figure
exact
cause
going
Deprecated
deprecated
uses
non
adapt
er
imageURL
Foundation
public
protocol
IdentityToken
Token
var
String
email
gender
locale
picture
identities
Array
Dictionary
Any
oauthClient
OAuthClient
defined
__has_feature
objc_arc
This
requires
ARC
support
endif
GooglePlacesDemos
DemoListViewController
GooglePlaces
The
cell
reuse
identifier
are
const
kCellIdentifier
DemoData
_demoData
ta
demoData
NSLocalizedString
App
display
navigation
bar
along
placeholder
SDK
number
title
stringWithFormat
GMSPlacesClient
viewDidLoad
Register
plain
old
UITableViewCell
sufficient
our
tableView
forCellReuseIdentifier
Demo
demo
give
us
view
controller
which
contains
UIViewController
viewController
Check
see
iOS
7
NSFoundationVersionNumber
NSFoundationVersionNumber_iOS_8_0
We
real
UIKit
automatically
push
onto
stack
small
screen
present
left
side
UISplitViewController
enough
space
sender
pragma
mark
UITableViewDataSource
Delegate
NSInteger
numberOfSectionsInTableView
UITableView
sections
numberOfRowsInSection
section
demos
NSIndexPath
indexPath
table
ew
forIndexPath
Grab
row
Configure
text
Get
selected
Support
NOTE
All
following
probably
your
own
enable
vc
have
stuff
behavior
that
has
split
splitViewController
update
its
viewControllers
didn
exist
must
iPhone
means
should
However
given
might
UINavigationController
case
only
thing
rather
than
itself
does
allow
navigationController
mutableCopy
animated
strict
test
require
tape
utilFunctions
utils
functions
exampleResult
Result
limit
function
resultDeepCopy
JSON
parse
stringify
newResult
fixLength
300
equal
unchanged
over
200
delete
req_body
did
longest
value
removed
two
keys
50
usrName
Test
result
undefined
deep
above
while
note
parsing
filtered
out
null
hi
Created
Jesse
Squires
jessesquires
Documentation
cocoadocs
docsets
JSQMessagesViewController
GitHub
https
github
2014
Released
MIT
license
opensource
collection
layout
taken
JSQMessagesCollectionViewFlowLayout
JSQMessageData
JSQMessagesCollectionView
JSQMessagesCollectionViewCell
JSQMessagesCollectionViewLayoutAttributes
JSQMessagesCollectionViewFlowLayoutInvalidationContext
JSQMessagesBubblesSizeCalculator
JSQMessages
CGFloat
20
0f
kJSQMessagesCollectionViewAvatarSizeDefault
30
UIDynamicAnimator
dynamicAnimator
visibleIndexPaths
latestDelta
dynamic
collectionView
synthesize
bubbleSizeCalculator
_bubbleSizeCalculator
Initialization
jsq_configureFlowLayout
sectionInset
UIEdgeInsetsMake
10
minimumLineSpacing
_messageBubbleFont
UIFont
preferredFontForTextStyle
UIFontTextStyleBody
UIDevice
currentDevice
userInterfaceIdiom
UIUserInterfaceIdiomPad
_messageBubbleLeftRightMargin
6
14
CGSize
defaultAvatarSize
CGSizeMake
_incomingAvatarViewSize
_outgoingAvatarViewSize
_springinessEnabled
1000
NSNotificationCenter
defaultCenter
addObserver
UIApplicationDidReceiveMemoryWarningNotification
awakeFromNib
Class
dealloc
removeObserver
Setters
JSQMessagesBubbleSizeCalculating
NSParameterAssert
springinessEnabled
_dynamicAnimator
_visibleIndexPaths
removeAllObjects
invalidateLayoutWithContext
context
messageBubbleFont
messageBubbleLeftRightMargin
ceilf
UIEdgeInsets
UIEdgeInsetsEqualToEdgeInsets
incomingAvatarViewSize
CGSizeEqualToSize
outgoingAvatarViewSize
Getters
itemWidth
CGRectGetWidth
frame
set
right
alloc
Notifications
NSNotification
jsq_resetLayout
Collection
v
flow
jsq_resetDynamicAnimator
pad
rect
avoid
padding
100
CGRect
CGRectInset
bounds
visibleItems
layoutAttributesForElementsInRect
NSSet
visibleItemsIndexPaths
val
NSStringFromSelector
attributesInRect
attributesInRectCopy
duplicate
attributes
attribute
item
regular
exists
UICollectionViewLayoutAttributes
eachItem
eachDynamicItem
m
representedElementCategory
continue
enumerateObjectsUsingBlock
attributesItem
NSUInteger
idx
stop
UICollectionElementCategoryCell
jsq_configureMessageCellLayoutAttributes
layoutAttributesForItemAtIndexPath
customAttributes
newBounds
scrollView
delta
origin
y
CGPoint
touchLocation
panGestureRecognizer
locationInView
behaviors
UIAttachmentBehavior
springBehaviour
jsq_adjustSpringBehavior
forTouchLocation
items
firstObject
prepareForCollectionViewUpdates
updateItems
updateItem
index
CGRectGetHeight
CGRectMake
jsq_springBehaviorWithLayoutAttributesItem
utilities
Message
messageBubbleSizeForItemAtIndexPath
messageItem
dataSource
messageDataForItemAtIndexPath
atIndexPath
withLayout
sizeForItemAtIndexPath
messageBubbleSize
finalHeight
height
messageBubbleTopLabelHeight
cellBottomLabelHeight
layoutAttributes
messageBubbleContainerViewWidth
width
textViewFrameInsets
messageBubbleTextViewFrameInsets
textViewTextContainerInsets
messageBubbleTextViewTextContainerInsets
cellTopLabelHeight
d
size
CGSizeZero
adding
zero
fail
springBehavior
center
newly
visible
indexSet
sel
f
touch
flight
CGPointZero
scrollResistance
MAX
MIN
HTTP
joda
time
JSQMessagesBubbleImage
initWithMessageBubbleImage
highlightedImage
messageBubbleImage
messageBubbleHighlightedImage
debugQuickLookObject
UIImageView
initWithImage
NSCopying
copyWithZone
NSZone
zone
allocWithZone
imageWithCGImage
CGImage
otc
saucelabs
broker
default
dist
cf
defaultexcludes
add
manifest
git
environment
env
os
family
windows
available
filepath
Path
exe
npm
md
locate
path
single
within
exactly
match
store
fileset
base
directory
pattern
relative
prefix
includes
depth
max
No
refid
Multiple
matches
when
PLATFORM
patternset
binary
include
jar
executable
tar
gz
zip
files
unix
exec
sh
exclude
scripts
invert
win
build
dev
pipeline
ub
workflow
Build
install
webapp
location
src
target
depends
Create
deployment
cloud
A
CF
run
revision
format
now
yyyy
MM
dd
HH
mm
ss
Z
build_info
append
false
package
excludes
node
node_modules
config
gzip
OTHER
unless
arg
rev
va
HEAD
ARObjectView
Carlos
11
2010
__MyCompanyName__
rights
reserved
ARKitEngine
initWithFrame
clipsToBounds
autoresizingMask
UIViewAutoresizingFlexibleWidth
UIViewAutoresizingFlexibleHeight
userInteractionEnabled
touches
withEvent
UIEvent
half
nconf
log4js
logger
slack
logBasePath
lib
middleware
auth
exports
checkOtcApiAuth
req
res
next
logPrefix
Basic
header
request
authHeader
Authorization
Split
grab
values
authHeaderParts
authPrefix
toLowerCase
authValue
basic
secret
matching
creds
Buffer
base64
toString
ascii
catch
ex
Credentials
service_id
expected
TIAM_CLIENT_ID
OTC_API_BROKER_SECRET
Invalid
status
401
An
invalid
authorization
swift
tools
minimum
Swift
PackageDescription
Package
BluePic
products
Products
define
produced
make
them
other
packages
library
targets
BluePicApp
BluePicServer
Kitura
upToNextMinor
CouchDB
CloudEnvironment
upToNextMajor
Bluemix
tracker
metrics
bluemix
mobile
services
simple
objectstorage
serversdk
security
appid
CredentialsFacebook
SwiftyRequest
BluemixObjectStorage
BluemixAppID
CloudFoundryDeploymentTracker
MetricsTrackerClient
response
XCLIResponse
helpers
xml_util
ElementNotFoundException
etree
Exception
Base
all
related
pass
Command
command
execution
parameters
etc
stable
API
catching
exceptions
subclasses
these
considered
change
KNOWN_CODES
KNOWN_LEVELS
return_value
__str__
classmethod
instantiate
cls
rootelem
cmdroot
xml_find
level
Unknown
concrete
elif
register
codes
deco
register_level
CommandExecutionError
Error
CommandFailedSyntaxError
3
CommandFailedRuntimeError
SyncAlreadyInactiveError
SyncAlreadyActiveError
S
U
V
CredentialsError
explicitly
want
differentiate
raised
directly
due
credentials
during
ret_str
isinstance
str
n
tostring
CommandFailedAServerError
aserver
CorruptResponse
Transport
TransportError
transport
occur
connection
cli
hamcrest
MatcherAssert
assertThat
Matchers
junit
runner
RunWith
tngtech
java
dataprovider
DataProvider
DataProviderRunner
UseDataProvider
NullPointerException
OGLog4jShutdownCallbackRegistry
setOGShutdownHook
Runnable
Override
true
final
boolean
IncompleteGzCompressAction
accept
Corporation
2017
commands
shell
script
immediately
source
cd
dirname
BASH_SOURCE
pwd
Setup
bold
Deploying
Kubernetes
Cluster
application
normal
Setting
up
Cloud
Environment
Checking
cluster
ip_addr
bx
cs
workers
KUBERNETES_CLUSTER_NAME
grep
z
created
ready
Container
cr
namespace
Helm
Tiller
component
helm
upgrade
kubectl
system
pods
Running
break
Waiting
sleep
Deploy
Services
SCRIPTS_FOLDER
Deployment
sys
requests
iot_org_id
device_id
device_type
api_token
classes
nlc_class
msg
confidence
r
post
messaging
internetofthings
ibmcloud
1883
device
types
devices
query
headers
Content
Type
token
MapKit
RecommendedRestaurantDetailView
UIView
IBOutlet
weak
locationNameLabel
UILabel
locationHeaderLabel
hoursTodayLabel
hoursLabel
openLabel
priceRangeLabel
reviewPositiveHighlightLabel
reviewPositiveHighlightHeaderLabel
reviewNegativeHighlightHeaderLabel
reviewNegativeHighlightLabel
reviewsFromGoogleLabel
addressLabel
visitWebsiteLabel
mapView
MKMapView
geocoder
discover
coordinates
private
starStackView
UIStackView
func
instanceFromNib
UINib
nibName
bundle
withOwner
override
setupView
textColor
UIColor
customRestaurantViewDarkBlueColor
font
boldSFNSDisplay
25
customRestaurantLabelColor
regularSFNSDisplay
addTextSpacing
spacing
customDarkBlueColor
16
Google
13
9
setupData
openNowStatus
Bool
openingTimeNow
locationName
locationAddress
city
priceLevel
Double
rating
reviewNegativeHighlight
reviewPositiveHighlight
openNow
open
OPEN
customOpenGreenColor
el
customClosedRedColor
openingTime
Utils
generateExpensiveString
Int
setUpStarStackView
numberOfStars
Set
positive
reviews
CLLocationDegrees
placemarks
Void
placemark
lat
coordinate
latitude
long
longitude
CLLocationCoordinate2D
region
MKCoordinateRegion
span
pin
addAnnotation
google
Preconditions
checkNotNull
Pair
K
getKey
Gets
pa
ir
getValue
UIBarButtonItem
coder
aDecoder
NSCoder
goToProfile
currentVC
getCurrentViewController
presentViewController
UIButton
profileButton
setImage
named
avatar
addTarget
forControlEvents
x
27
customView
enum
Method
GET
POST
PUT
equals
unsupported
intended
Travis
CI
running
elsewhere
invoke
TRAVIS_PULL_REQUEST
shellcheck
disable
SC1090
resources
is_pull_request
Install
CLI
L
dhe
latest
Bluemix_CLI_amd64
Bluemix_CLI
xvf
sudo
install_bluemix_cli
LO
googleapis
kubernetes
release
txt
linux
amd64
chmod
0755
mv
usr
local
container
service
plugin
DEBUG
BMSCore
AuthorizationUIManager
oAuthManager
OAuthManager
authorizationDelegate
AuthorizationDelegate
authorizationUrl
redirectUri
Logger
bmsLoggerPrefix
loginView
safariView
launch
rootView
UIApplication
shared
keyWindow
rootViewController
currentView
presentedViewController
DispatchQueue
async
_
UIApplicationOpenURLOptionsKey
errMsg
dismiss
guard
onAuthorizationFailure
AuthorizationError
authorizationFailure
Failed
extract
grant
tokens
tokenManager
obtainTokens
err
getParamFromQuery
paramName
registrationManager
authorizationManager
launchAuthorizationUI
errorDescription
error_description
errorCode
access
identity
urlString
lowercased
hasPrefix
AppIDConstants
REDIRECT_URI_VALUE
gets
filters
takes
JSON_CODE_KEY
TokenResponseDelegate
onAuthorizationCanceled
QueryParameters
S3
marker
OpenStack
Legalhold
parameter
legalHold
legalhold
deleting
remove
unittest
codecs
mock
Mock
fromstring
TestCase
_readfile
fname
join
__file__
utf
getattr
XCLI_XML_RESULT_SUCCESS_CODES
success
setUp
xcli_client
user
password
populate
xcli_xml_result
_build_response
assertIsInstance
len
as_list
Should
exception
assertTrue
assertEqual
mockito
Mockito
io
IOException
concurrent
TimeUnit
Before
gson
stream
JsonReader
JsonWriter
TimeUnitTypeAdapter
typeAdapter
before
write
throws
writer
SECONDS
seconds
reader
nextString
thenReturn
Operation
Request
Response
Context
WriteCopyObjectNameConsumer
extends
AbstractObjectNameConsumer
ObjectManager
objectManager
Integer
statusCodes
ager
WRITE_COPY
protected
getContext
X_OG_SSE_SOURCE_OBJECT_NAME
Long
parseLong
X_OG_OBJECT_SIZE
int
containerSuffix
X_OG_SSE_SOURCE_OBJECT_CONTAINER_SUFFIX
parseInt
updateObjectManager
ObjectMetadata
objectName
handle
getObjectName
objectString
objectSize
byte
numLegalHolds
getNumberOfLegalHolds
retention
getObjectionRetention
LegacyObjectMetadata
fromMetadata
getComplete
Promise
bluebird
Twit
twitter
consumer_key
consumer_secret
access_token
access_token_secret
timeout_ms
Extract
hashtags
inputText
regex
zA
gm
handles
character
around
tweet
looks
mentions
keywords
their
search
export
analyzeTweet
console
analyze
Look
Twitter
profile
resolve
reject
state
tweeted
statuses
body
head
Find
those
timeline
third
concat
con
cat
last
few
looking
pre
parsed
entities
j
Date
getTime
analyzed
lifecycle
recommended
rendered
replied
payload
Invoke
schedule
recommend
invokeScheduleRecommend
whisk
example
org_space
pyspark
SparkContext
subprocess
sc
gensort
appName
nworkers
environ
48
nrecords_per_worker
worker_dir
SPARK_HOME
IBM_ARL_teraSort_v1
offset
b
input
stdout
calling
worker
sort
C
output
sorted
g
map
collect
guice
annotation
lang
ElementType
FIELD
METHOD
PARAMETER
RetentionPolicy
RUNTIME
Retention
Target
inject
BindingAnnotation
ReadHeaders
internal
AppIDError
registrationError
jsonUtilsError
generalError
switch
General
Configuration
Appenders
Console
SYSTEM_OUT
PatternLayout
SSS
5p
l
ThresholdFilter
Loggers
report
info
Root
AppenderRef
ref
Bodies
statistic
Statistics
LoadTest
Rule
rules
ExpectedException
thrown
none
WRITE
stats
IllegalArgumentException
99
600
statusCode
thresholdValue
expectedException
expect
StatusCodeCondition
getMethod
getBody
getOperation
getStatusCode
isTriggered
Alamofire
Software
alamofire
Permission
hereby
granted
free
charge
person
obtaining
associated
documentation
deal
restriction
including
limitation
modify
merge
publish
distribute
sublicense
sell
copies
permit
persons
whom
furnished
subject
conditions
copyright
notice
permission
shall
included
substantial
portions
THE
SOFTWARE
PROVIDED
WARRANTY
EXPRESS
IMPLIED
INCLUDING
BUT
NOT
LIMITED
TO
MERCHANTABILITY
FITNESS
FOR
PARTICULAR
PURPOSE
NONINFRINGEMENT
IN
EVENT
SHALL
AUTHORS
COPYRIGHT
HOLDERS
BE
LIABLE
CLAIM
DAMAGES
LIABILITY
WHETHER
AN
ACTION
CONTRACT
TORT
OTHERWISE
ARISING
FROM
OUT
CONNECTION
WITH
USE
DEALINGS
Dispatch
extension
global
qos
userInitiated
utility
background
after
delay
TimeInterval
execute
closure
escaping
asyncAfter
deadline
syncResult
T
sync
circuitBreakerController
scope
circuitMessage
endpointMessage
waiting
endpointDelay
enabled
endpoint
currently
disabled
Working
changeEndpointState
timeout
60000
onSuccess
Change
successful
been
onFailure
errStr
Failure
changed
Payload
received
400
Bad
greater
500
In
Could
statusText
David
Okun
17
XCTest
testable
LogisticsWizardMobile
XCTestCase
Put
setup
here
invocation
each
tearDown
teardown
testExample
Use
XCTAssert
tests
produce
correct
results
performance
measure
perf_test
perf_harness_2
stac_benchmark
Cleaning
dropping
caches
seq
15
red
ssh
proc
vm
drop_caches
cleaning
dirs
perf_harness
clean_files_and_dirs_ALEX
Finished
cleanup
serverFolder
variable
SERVER_FOLDER
based
clean
Cloudant
cloudant
OpenWhisk
entry
point
param
args
Expected
arguments
li
demoGuid
weather
database
Database
recommendations
returns
New
lon
waterfall
existing
callback
retrieve
retailers
getRetailers
identify
shipments
persist
KO
ok
OK
Got
v1
Retrieving
ERROR
forEach
retailer
ing
address
calculate
distance
radius
Location
Making
recommendation
NEW
estimatedTimeOfArrival
00
000Z
fromId
toId
ret
cloudantUrl
cloudantDatabase
Removing
retry
db
q
guid
include_docs
rows
Deleting
toDelete
eslint
line
_id
doc
_rev
_deleted
bulkErr
records
docs
into
LASTRUN
ls
perf_data_2
account
full
insertTweet
insert
saveTweet
replace
owplan
trim
saving
409
inserted
After
invokeTweetAnalyze
bodyParser
parser
HttpsAgent
nano
nanoDocUpdater
updater
underscore
until
stage
job
swaggerUiMiddleware
swagger
ui
__dirname
spec
DB_NAME
configureMiddleware
externalCallback
auto
validateOptions
validateConfSync
createDb
initializeDb
initOrUpdateDesign
configureAppSync
occurred
process
keepAlive
Verify
expects
requiredKeys
PORT
TIAM_URL
slack_api
otc_api
otc_ui
icons
toolchain
missingRequiredKeys
configuration
fields
overridden
k
__
Service
binding
because
first
vcap_services
cloudantNoSQLDB
cloudantNoSQLDBService
cloudantNoSQLDBServices
find
_vcap_services
indexOf
isArray
Either
containing
least
instanceUrl
scheme
ring
comes
appears
forwarded
proto
403
connectLogger
ms
getStatus
BUILD_NUMBER
extend
host
schemes
Tack
every
servicesDb
OTC
operations
provision
bind
unbind
service_instances
Endpoint
routes
implemented
handled
route
errorObject
errorMessage
Route
doesn
404
keepAliveAgent
ma
30000
nanoObj
agent
create
Creating
DESIGN_DOC_NAME
_design
DESIGN_DOC
javascript
views
service_instance
emit
existingDoc
newDoc
shouldUpdate
newVer
angular
bluepicWebApp
fbProfileImg
fbCoverImg
PropertiesService
fbHometown
usersPhotos
userName
photos
hometown
searchTerm
JSQMessagesAvatarImage
initWithAvatarImage
placeholderImage
avatarImageWithPlaceholder
avatarImage
avatarHighlightedImage
avatarPlaceholderImage
ge
ObjectConfig
SelectionType
selection
minSuffix
maxSuffix
FIXME
uuid
writes
manager
reads
implementations
generic
occurs
MAX_VALUE
NUMBER
BATCH
STREAMS
ITERATIONS
DELAY
INTERACTIVE
Initialize
Parameters
batch
workload
NUM_BATCH_STREAMS
BATCH_STREAM_OFFSET
60
BATCH_NUM_SEQ_ITER
BATCH_QUERY_DELAY
BATCH_SEQ_DELAY
120
BATCH_TPCDS_DB_PATH
hdfs
YOUR_HDFS_HOST
48020
root
tpcds_sfactor_24
WORKLOAD_DELAY
interactive
NUM_INT_STREAMS
INT_STREAM_OFFSET
INT_NUM_SEQ_ITER
INT_QUERY_DELAY
INT_SEQ_DELAY
INT_TPCDS_DB_PATH
tpcds_sfactor_12
mkdir
tmp
spark
R
777
DATEFORNMON
start_nmon_monitor
PERF_DATA
timestamp
steps
NUM_STREAMS
STREAM_OFFSET
iters
NUM_SEQ_ITER
Output
SPARK_CONF_DIR
defaults
conf
date
Start
COUNTER
lt
Starting
Batch
Step
single_stream_async
Wait
duration
take
longer
TOTAL_LINES
Total
lines
NUM_LINES
Number
less
total
again
results_
wc
got
Collect
COMMENT_OUT_NMON
stop_nmon_monitor
nmon
stored
OUTPUTDIR
rm
rf
hadoop
fs
Done
below
collecting
logs
creating
processed
ng
since
perf_data
driver_output_
env_output
_int
perf_utilities
timings
p
put
submit
master
SPARK_MASTER_URL
deploy
mode
benchmarks
smb2
analysis
SMB2AnalysisNew
SMB2Analysis
rmr
NUM_STEPS
STEP_OFFSET
STEP_ITERATIONS
complete
RestCall
IBMFlightTracker
Sanjeev
Ghimire
SwiftyJSON
username
fetchWeatherBasedOnCurrentLocation
weatherData
cannot
urlRequest
URLRequest
session
URLSession
task
dataTask
responseData
receive
observation
temperature
temp
weatherIconUrl
mybluemix
net
icon
png
resume
observations
units
en
US
CoreLocation
LocationDataManagerError
failure
getting
represents
imperial
unit
metric
LocationDataManager
Shared
SharedInstance
CLLocationManager
fileprivate
locationManager
inform
denied
isLocationServicesEnabledAndIfNotHandleItCallback
isEnabled
current
getUsersCurrentLocationCallback
CLLocation
Locale
desiredAccuracy
requestWhenInUseAuthorization
cb
Something
went
wrong
comment
CLAuthorizationStatus
authorizationStatus
completionHandler
From
localizedDescription
co
Current
And
State
ent
CLLocationManagerDelegate
didUpdateLocations
locations
didFailWithError
User
authorized
It
BXUSER
BXPASS
wordpress
Downloading
promise
openwhisk
CREATE
validate
MQTT
feed
Success
trigger
invoking
provider
These
Watson
IoT
used
subscribing
topic
hasOwnProperty
Missing
mandatory
setting
user_pass
authKey
Send
both
triggerName
slice
openWhiskUsername
openWhiskPassword
watsonUsername
watsonPassword
watsonClientId
uri
provider_endpoint
Map
Maps
StoppingConditionsConfig
double
runtime
runtimeUnit
newHashMap
redux
saga
select
effects
Constants
pascalEntityName
Actions
quote
actions
ACTION_HANDLERS
Reducer
initialState
Title
camelEntityName
handler
Sagas
js
sagas
normally
somewhere
fetch
quotes
rest
category
contents
yield
dispatched
simulate
load
NSBundle
jsq_imageMaskedWithColor
imageRect
newImage
UIGraphicsBeginImageContextWithOptions
scale
CGContextRef
CGContextSetFillColorWithColor
CGColor
UIGraphicsGetImageFromCurrentImageContext
UIGraphicsEndImageContext
jsq_bubbleImageFromBundleWithName
pathForResource
ofType
Images
imageWithContentsOfFile
jsq_defaultPlayImage
play
pause
fmt
flag
toml
ubiquity
web_server
jinzhu
gorm
configFile
fig
Parse
UbiquityServerConfig
Printf
Ubiquity
Storage
Stat
IsNotExist
panic
Sprintf
Cannot
Println
defer
InitFileLogger
GetLogLevelFromString
LogLevel
Join
LogPath
logFile
NewExecutor
ConfigPath
lock
heartbeat
initialize
Heartbeat
go
DB
Open
sqlite3
connect
Close
Volume
clients
Port
Update
updating
Second
pr
Exists
currentTime
Now
Unable
determine
Sub
CwS
opt
conductor
ENV_INFO
yes
egosh
ego
start
logon
u
Admin
spark201
sparkss
sparkhs
sparkms
75
rg
starting
facebook
authentication
calls
FacebookDataManager
facebookAppID
Bundle
forInfoDictionaryKey
facebookURLScheme
Is
Facebook
Congigured
Authentication
configured
Info
plist
configure
such
fb
BluemixDataManager
bluemixConfig
appIdTenantId
ID
tenantId
made
past
UserIdentity
authManager
BMSClient
sharedInstance
userIdentity
urllib
engine
cs_key
Custom
cx_id
perform
searches
per
where
specify
web
site
amazon
WARNING
limits
how
many
reach
Search
shirts
urls
customsearch
cx
Convert
jsonResps
Getting
resp
urlopen
ur
loads
counter
link
Only
links
pages
lists
Processing
html
file_object
w
Store
page
bottom
href
encode
utf8
close
Calendar
year
month
day
weekOfYear
hour
minute
weekday
fromDate
DateComponents
dateComponents
timeInterval
timeSinceDateString
weeksFrom
daysFrom
hours
he
hoursFrom
minutesFrom
secondsFrom
letter
word
week
minutes
representing
ImageDetailViewModel
constant
IndexPath
tags
label
MARK
View
Controller
ViewModel
Communication
tion
numberOfItemsInSection
kind
UICollectionView
ImageInfoHeaderCollectionReusableView
withReuseIdentifier
sets
ce
ll
tag
TagCollectionViewCell
UICollectionViewCell
dequeueReusableCell
tagLabel
uppercased
withAttributes
NSAttributedStringKey
ofSize
referenceSizeForHeaderInSection
collectionViewLayout
UICollectionViewLayout
sample
captionLabel
numberOfLines
attributedText
NSAttributedString
caption
letterSpacing
lineSpacing
centered
sizeToFit
F
FeedViewController
vcWithNameFromStoryboardWithName
storyboardName
Feed
searchQuery
resetTestDb
reset
through
README
designDocId
foo
arbitraryDocId
rawDb
promisifyAll
promisify
getAsync
design
still
deleted
NotFoundError
arbitrary
instanceof
finally
series
Add
document
lower
updateJob
even
newer
reduce
sum
Place
Delete
not_found
12
LAT_LON_FACTOR
Used
calculation
H_PIXELS_PER_DEGREE
How
pixels
degree
360
degrees
affect
radiansToDegrees
180
M_PI
degreesToRadians
degreeNormalized
fmod
angle
deltaAngle
provides
ARFlightViewController
information
needed
annotations
provide
Annotation
subclass
ARFlightAnnotationView
ar
arViewController
FlightAnnotation
optional
SwiftEnterpriseDemo
HeliumLogger
majorVersion
CircuitBreaker
SwiftMetrics
ion
alert
sdk
folder
scriptsFolder
FlightBubbleV1
altitude
flightImage
flightName
appGuid
grant_type
imf
authserver
apps
H
form
urlencoded
charset
counters
supplier
ObjectManagerException
ReadObjectNameFunction
objec
getName
getSize
getContainerSuffix
SourceReadObjectNameFunction
apply
thenThrow
RetentionConfig
expiry
timeUnit
MAX_RETENTION_EXPIRY
WebCache
WebCacheOperation
char
imageURLKey
TAG_ACTIVITY_INDICATOR
TAG_ACTIVITY_STYLE
TAG_ACTIVITY_SHOW
sd_setImageWithURL
SDWebImageCompletionBlock
objc_setAssociatedObject
OBJC_ASSOCIATION_RETAIN_NONATOMIC
dispatch_main_async_safe
wself
removeActivityIndicator
SDWebImageAvoidAutoSetImage
setNeedsLayout
sd_setImageLoadOperation
SDWebImageErrorDomain
NSLocalizedDescriptionKey
Trying
sd_setImageWithPreviousCachedImageWithURL
objc_getAssociatedObject
arrayOfURLs
sd_cancelCurrentAnimationImagesLoad
operationsArray
sself
stopAnimating
currentImages
startAnimating
sd_cancelImageLoadOperationWithKey
UIActivityIndicatorView
activityIndicator
OBJC_ASSOCIATION_RETAIN
show
NSNumber
numberWithBool
boolValue
style
intValue
initWithActivityIndicatorStyle
translatesAutoresizingMaskIntoConstraints
addSubview
addConstraint
NSLayoutConstraint
constraintWithItem
NSLayoutAttributeCenterX
relatedBy
NSLayoutRelationEqual
toItem
multiplier
removeFromSuperview
setImageWithURL
SDWebImageCompletedBlock
rl
factory
websocketFactory
homeController
autoScalingController
SVProgressHUD
TabBarViewController
temporarily
cover
content
appear
showing
login
backgroundImageView
model
keep
handling
viewModel
TabBarViewModel
upon
lo
ad
creates
color
adds
setDefaultStyle
SVProgressHUDStyle
setBackgroundColor
white
notifyTabBarVC
tintColor
viewDidAppear
tryToShowLogin
didReceiveMemoryWarning
hide
prevent
animation
isHidden
VC
Main
Return
home
window
selectedIndex
FeedNavigationController
tab
whether
camera
whatever
tabBarController
picker
actually
Selected
CameraDataManager
UIAlertController
Required
Please
preferredStyle
cancelAction
UIAlertAction
Cancel
addAction
showImageUploadFailureAlert
To
Upload
UIAlertControllerStyle
Try
tabBarNotification
TabBarViewModelNotification
showLoginVC
hideLoginVC
switchToFeedTab
showSettingsActionSheet
logOutSuccess
Log
UIAlertActionStyle
modalPresentationStyle
notNullValue
ByteArrayInputStream
ByteArrayOutputStream
File
FileNotFoundException
FilenameFilter
InputStream
OutputStream
nio
ByteBuffer
Arrays
HashSet
List
UUID
BaseEncoding
ObjectFileUtil
ObjectFileVersion
nonExistent
ObjectFile
getInputStream
System
getOutputStream
objectMetadata
randomUUID
0000
3600
VERSION
inputByteBuffer
allocate
getBytes
array
VERSION_HEADER_LENGTH
OBJECT_SIZE
outputBuffer
wrap
toByteArray
position
filteredBytes
fromBytes
getRetention
expectedObject
1024
inputBuffer
toBytes
outBuffer
objectBuffer
MAJOR_VERSION
MINOR_VERSION
ENCODING
base16
lowerCase
decode
OBJECT_NAME_SIZE
putLong
putInt
1L
minFilesize
maxFilesize
minContainerSuffix
maxContainerSuffix
containerSuffixes
minLegalHolds
maxLegalHolds
minRetention
maxRetention
inal
filter
o1
o2
o3
writeObjectFileVersion
am
2L
24
nal
suffix
SuppressWarnings
resource
maxObjects
ObjectFileOutputStream
fileCount
o
filename
AuthType
NONE
BASIC
AWSV2
AWSV4
HOSTS
agent_list
zookeeper
MASTER
mesos
zk
absence
master_list
LINE
iperf
footer
LoginResponse
KituraNet
cloudantId
kituraHost
kituraSchema
requestOptions
ClientRequest
Options
schema
hostname
port
requestHeaders
Length
Status
LoggerAPI
MemoryUser
bytes
memoryPointer
UnsafeMutablePointer
Int8
pointer
capacity
me
verbose
initialized
memory
deinit
syslogAppender
dgram
udp
plan
listening
1514
syslog
loadAppender
qradar
appender
addAppender
appenders
localhost
useUdpSyslog
hai
usage
USAGE
NAME
basename
JML_FILE
localPath
sl
IAAS_LOCATION
iaas
JML
consider
reading
APIs
iaas_get
iaas_get_key
shift
E
envvar
specified
CF_APP
DOMAIN
ENV
actual
logmet
qradar_host
variables
devops
assets
modules
32
ENABLE_NEW_RELIC
NEW_RELIC_LICENSE_KEY
parse_inputs
Querying
main_design
_view
descending
users
dat
images_per_user
endkey
startkey
images_by_id
group
images_by_tags
mountain
cloudy
sky
Successfully
nativeShadow
nativeCssVariables
settings
StyleNode
unused
vars
toCssText
typeof
forEachRule
rulesForStyle
__cssRules
textContent
Tests
rule
keyframes
scoping
Boolean
MEDIA_RULE
matchMedia
media
skip
STYLE_RULE
cssText
moniker
contextNode
createElement
setAttribute
lastHeadApplyNode
styling
placeHolder
createComment
Shady
DOM
styles
nextSibling
insertBefore
firstChild
compareDocumentPosition
Node
shadow
shady
element
getAttribute
outer
paren
everything
inner
substring
comma
fallback
lookup
native
ShadyDOM
patched
nativeMethods
getIsExtends
localName
typeExtension
technically
certain
svg
elements
face
ITERATION
SEQUENCES
BETWEEN
QUERIES
SEQUENCE
QUERY
STREAM
PATH
TPC
DS
DATABASE
NUMSEQITER
QUERYDELAY
SEQDELAY
STREAMID
TPCDSPATH
Single
Stream
Sequential
Query
sequences
Initializing
Q3
Q8
Q53
Q89
KMS
sequence
Q
Select
random
RANDOM
MASTER_NAME
MESOS
7077
Master
CURRENTTIME
Y
M
PERFDIR
FILENAME
CURRENTTIME_
JOBLOG
TIMESTAMP_FILE
TIMESTAMP
metastore_db
Iterate
SEQCOUNTER
jobs
QUERYCOUNTER
asyncbatch
AsyncBatchQueries
driver
3g
UserAsyncQueryStream_
STREAMID_
PID_SPARK_SUBMIT
yarn
kill
too
wait
JOBDIR
timing
math
rand
onsi
ginkgo
gomega
docker
core
fakes
strconv
reflect
Describe
activate
fakeClient
FakeStorageClient
BeforeEach
backends
Backend
testLogger
remote
activateResponse
Activate
Expect
Implements
ToNot
Equal
Errorf
valid
opts
CreateVolumeReturns
createRequest
CreateVolumeRequest
Name
dockerVolume1
Opts
Filesystem
gpfs1
createResponse
Err
CreateVolumeCallCount
dockerVolume
Remove
GetVolumeReturns
RemoveVolumeRequest
removeResponse
RemoveVolumeReturns
removing
volume
RemoveVolumeCallCount
volumes
dockerVolumes
ListVolumesReturns
listResponse
Volumes
mountpoint
GetVolumeConfigReturns
getRequest
GetVolumeConfigRequest
getResponse
listing
St
backend
num
eq
DeepEqual
mounted
pathRequest
pathResponse
P
ath
Mountpoint
Na
Mount
mountpath
mountRequest
AttachRequest
mountResponse
linking
est
Unmount
unmountRequest
DetachRequest
unmountResponse
un
DetachReturns
unlink
st
KituraContracts
Because
Linux
objects
AnyObject
branch
however
accepts
typealias
ServerController
router
Router
cloudFunctionsProps
objectStorageConn
ObjectStorageConn
pushNotificationsClient
PushNotifications
objStorageConnProps
ObjectStorageCredentials
Instance
constants
cloudEnv
encoder
JSONEncoder
decoder
JSONDecoder
WebAppKituraCredentialsPlugin
webCredentialsPlugin
landing_url
homepage
ping
kUsersPath
kImagesPath
couchDBCredentials
objStoreCredentials
appIdCredentials
pushCredentials
IO
appropriate
Instantiate
dbClient
bluepic_db
bluemixRegion
Region
clientId
8080
Web
Enable
Plugin
handlers
authenticate
appIdAuthContext
identityTokenPayload
dictionary
unauthorized
logout
userId
getImagesForUser
getImage
getImages
postImage
getTags
getUsers
getUser
postUser
imageId
sendPushNotification
RouterRequest
RouterResponse
Hello
World
documents
BluePicLocalizedError
missingUserId
anyUserId
KeyType
queryParams
endKey
startKey
readByView
notFound
Codable
most
popular
th
RequestError
PopularTag
respondWith
Sort
includeDocs
StringUtils
anyTag
zeroKey
record
fileName
createObject
internalServerError
processImage
processing
CloudFunctions
verifying
createContainer
badRequest
NotificationStatus
deviceId
JSONSerialization
jsonObject
getImagesFailed
Notification
badge
sound
DEFAULT
platforms
Your
WriteBody
i18n
msgs
nls
sauce_creds
org_missing
usernamekey_missing
alreadybound
XXX
failedtobind
nosuchinstance
deletefail
unbindall
notbound
database_write
405
Code
generated
counterfeiter
DO
EDIT
mounter
block_device_utils
FakeBlockDeviceUtils
struct
RescanAllStub
withISCSI
bool
rescanAllMutex
RWMutex
rescanAllArgsForCall
rescanAllReturns
result1
rescanAllReturnsOnCall
devicePath
fsType
mountPoint
mountDeviceFlowMutex
mountDeviceFlowArgsForCall
mountDeviceFlowReturns
mountDeviceFlowReturnsOnCall
RescanStub
Protocol
rescanMutex
rescanArgsForCall
rescanReturnsOnCall
ReloadMultipathStub
reloadMultipathMutex
reloadMultipathReturnsOnCall
DiscoverStub
volumeWwn
discoverMutex
discoverArgsForCall
result2
discoverReturnsOnCall
CleanupStub
mpath
cleanupMutex
cleanupArgsForCall
cleanupReturnsOnCall
CheckFsStub
checkFsMutex
checkFsArgsForCall
checkFsReturnsOnCall
MakeFsStub
makeFsMutex
makeFsArgsForCall
makeFsReturnsOnCall
MountFsStub
mpoint
mountFsMutex
mountFsArgsForCall
mountFsReturnsOnCall
UmountFsStub
umountFsMutex
umountFsArgsForCall
umountFsReturnsOnCall
invocations
invocationsMutex
fake
RescanAll
Lock
specificReturn
recordInvocation
Unlock
RLock
RUnlock
MountDeviceFlow
Call
MountDeviceFlowStub
Rescan
RescanCallCount
RescanArgsForCall
RescanReturnsOnCall
ReloadMultipath
reload
Discover
discoverReturns
DiscoverReturns
Cleanup
CheckFs
CheckFsReturns
MakeFs
MakeFsCallCount
MakeFsReturns
MountFs
UmountFs
Invocations
copiedInvocations
range
BlockDeviceUtils
FlightCalloutView
23
altitudeInMeters
velocityInMetersPerSecond
calloutOpen
logostore
globalid
ProductDetail
aspx
pid
shirt
Shirt
Eye
Bee
Cap
cap
caps
hat
hats
11oz
Mug
mug
mugs
cup
cups
HTML
Discovery
help
seed
references
sidx
div
eidx
buf
JSQMessagesCollectionViewCellIncoming
Overrides
messageBubbleTopLabel
textAlignment
NSTextAlignmentLeft
cellBottomLabel
Download
wget
quiet
xf
alias
Armada
CS
room
invoked
readings
individual
connected
sent
via
WiFi
history
also
future
bot
winston
models
roles
warn
ERP
ERPUser
RETAIL_STORE_MANAGER_ROLE
role
LOG_LOCATION
tee
Opening
100000000
parts
Complete
DeviceEvent
Records
foreground
goes
Note
watchOS
Analytics
methods
metadata
network
Mobile
BMSAnalytics
BMSPush
recorded
framework
AnalyticsDelegate
analytics
sends
mobileanalytics
mobileanalytics_overview
subscribe
recording
apiKey
When
Determines
didSet
Public
Methods
added
maxLogStoreSize
At
supply
rec
Blockchain
xhr
XMLHttpRequest
addEventListener
evt
responseText
setRequestHeader
USER
chaincode
AuthorizationManager
RegistrationManagerLoggerName
RegistrationManager
AppID
authorizationUIManager
appId
getAuthorizationUrl
idpName
accessToken
responseType
Config
getServerUrl
getRegistrationDataString
client_id_String
arrayName
JSON_REDIRECT_URIS_KEY
arrayIndex
JSON_REDIRECT_URI_KEY
accessTokenString
ensureRegistered
allowCreateNewAnonymousUsers
accessTokenToUse
latestAccessToken
raw
Not
anonymous
internalCallback
BMSCompletionHandler
returned
logAndFail
HttpMethod
queryParameters
requestTimeout
sendRequest
ack
unWrappedBody
internalCallBack
tokenResponseDelegate
isAnonymous
FeedController
feed_controller
track
VCAP_SERVICES
appEnv
cfenv
openfridge
CLOUDANT_USERNAME
CLOUDANT_PASSWORD
IP
Agent
hosts
communication
3000
initialise
handle_error
back
needs
mqtt
De
listen
Trigger
Provider
SDWebImage
ImageFeedTableViewCell
ProfileTableViewCell
setupDataWith
userImageView
textView
displays
photo
captionTextView
UITextView
shown
loadingView
shows
numberOfTagsLabel
amount
constraint
top
multiple
Tags
Tag
defaultAttributes
foregroundColor
black
NSMutableParagraphStyle
alignment
paragraphStyle
populating
UI
numOfTags
setCaptionText
posted
ts
timeStamp
40
kEmptyCaptionPlaceHolder
textContainerInset
isExpanded
abc
NSRange
attributedString
NSMutableAttributedString
addAttribute
gray
locally
imageView
placeHolderImage
aren
generate
CurrentUser
facebookUserId
img
imagesTakenDuringAppSessionById
loading
turn
nsurl
isn
nc
sd_setImage
MQTTSubscriptionMgr
constructor
connections
conn_client
rejectUnauthorized
connectTimeout
90
topics
reconnect
Connection
disconnected
his
is_connected
topic_client
listener_count
unsubscribe
Subscribed
BMSPushNotificationAction
BMSPushClient
authenticationRequired
activationMode
UIUserNotificationActivationMode
Initializers
ParametersAreNonnullByDefault
javax
ContainerCreateHeaders
buildAndPush
imageName
names
look
IMAGE_NAME
Using
Make
Docker
pv
pvc
gitlab
kubectl_config
Configuring
CLUSTER_NAME
kubectl_deploy
quickstart
Timeout
test_failed
elapsed
verify_deploy
Verifying
IPS
sS
test_passed
MultipartConfig
SelectionConfig
partSize
partsPerSession
targetSessions
CocoaMQTT
MQTTConnection
API_KEY
IOT_TOPIC
iot
connectToMQTT
_delegate
UInt16
NODE_ENV
node_env
Load
testUtils
defaultHeaders
Accept
mockServiceInstanceId
mockToolchainId
111
serviceInstanceUrlPrefix
pagerduty
serviceInstanceUrl
unknownUserEmail
unknown_user
tiamCredentials
valueOf
pagerdutySiteName
pagerdutyApiKey
pagerdutyDefaultHeaders
pagerdutyApiUrl
testId
testNumber
they
executed
Nock
nock
nockMode
NOCK_MODE
fully
capture
nockRecordMode
PagerDuty
Broker
recorder
Doing
ops
endpoints
TIAM
replaced
tiam
tiamUrl
nockDefs
nocks
tiamNocks
aNock
filtering
place
tape00000000000000
started
notOk
Did
instances
escalation
policies
deleteAllFrom
test_
Teardown
testing
organization_guid
Security
Model
beta
putServiceInstance
resultNoHeader
Auth
der
Creds
tiamHeader
test_tiam_id
test_tiam_secret
manage
postRequest
notEqual
service_credentials
toolchain_credentials
target_credentials
resultNoBody
resultNoOrg
api_key
getPostServiceInstanceParameters
getTestPagerDutyInfo
cal
site_name
user_email
gmail
phone
user_phone
allback
19
getNewInstanceBody
succeed
instance_id
Ensure
assertServiceAndUser
dashboard
accessible
assertDashboardAccessible
being
ones
service_name
Suffix
resu
reusing
pagerduty2
di
assertService
contact
previous
pagerdutyHeaders
escalation_policy
escalation_policy_url
escalation_policies
reqRes
policy
escalation_rules
were
escalation_rule1
Primary
escalation_rule2
Contact
user_phone_country
user_phone_number
serviceInstanceUrl2
18
serviceInstance
PATCH
patch
pagerdutySiteName2
pagerdutyApiKey2
patchRequest
resultFromPatch
assertServiceAndUserOnPagerDutySite
newSiteName
bad
callba
ck
newServiceName
Updated
addServiceToDelete
dashboard_url
newEmail
updated
35
newUserPhoneNumber
newPhone
registered
unknown
unknow_service
Bind
toolchainUrl
toolchains
removeFromToDelete
putRequest
resultsFromBind
204
Messaging
Like
Event
pagerDutyServiceId
incidentNumber
Pipeline
messagingEndpoint
message_store_pipeline_event
toolchain_id
basicHeader
resultFromPost
assert
incident
getIncident
unction
Job
prod
Stage
Toolchain
FAILED
getTestUserEmail
Simulate
functi
delRequest
resultsFromDel
Unbind
remain
se
buildID
work
nockCalls
writeFileSync
Keep
uniq
nockCall
unique
Slack
ease
mechanism
nockScopeUrl
dashboardUrl
addToDeleteIfAbsent
apiUrl
pagerdutyServiceUrl
escalationPolicyUrl
special
userUrl
toDeleteForType
findWhere
collections
collectionIndex
typeIndex
del
pagerdutyServiceId
incidents
encodeURIComponent
foundIncidents
setTimeout
retrieved
resolved
assertServiceOnPagerDutySite
foundServices
Policy
escalation_rule
contact_methods
country_code
phone_number
SMS
notification_rules
phone_rule
sms_rule
notificationRule
contact_method
33
initializeRequestParams
outputObject
clone
reference
nbind
urn
JSQMessagesCollectionViewCellOutgoing
JSQMessagesTypingIndicatorFooterView
JSQMessagesLoadEarlierHeaderView
jsq_configureCollectionView
backgroundColor
whiteColor
registerNib
nib
forCellWithReuseIdentifier
cellReuseIdentifier
mediaCellReuseIdentifier
forSupplementaryViewOfKind
footerReuseIdentifier
UICollectionElementKindSectionHeader
headerReuseIdentifier
jsq_messageBubbleLightGrayColor
jsq_colorByDarkeningColorWithValue
3f
jsq_messageBubbleBlueColor
indicator
footerView
messageBubbleColor
shouldDisplayOnLeft
earlier
messages
headerView
loadButton
Messages
indexPathForCell
avatarImageView
SEL
withSender
greaterThanOrEqualTo
times
URI
URISyntaxException
CounterCondition
ht
HttpRequest
HttpResponse
scheduling
ConcurrentRequestScheduler
Scheduler
Counter
TestCondition
eventbus
EventBus
Subscribe
SettableFuture
RequestManager
requestManager
scheduler
LoadTestSubscriberExceptionHandler
Builder
127
withContext
X_OG_REQUEST_ID
withStatusCode
eventBus
setLoadTest
OPERATIONS
requestSupplier
IllegalStateException
shutdown
consume
RuntimeException
Lists
ChoiceConfig
choices
newArrayList
readFileSync
deps
isModified
getOwnPropertyNames
numbers
urlObj
Replace
IDS_USER
IDS_PASS
changes
modified
blob
ContainerConfig
Gson
TypeAdapter
TypeAdapterFactory
TypeToken
JsonToken
ContainerConfigTypeAdapterFactory
implements
unchecked
rawType
getRawType
getDelegateAdapter
peek
nullSafe
OverwriteHost
JSQMessagesInputToolbar
JSQMessagesComposerTextView
JSQMessagesToolbarButtonFactory
kJSQMessagesInputToolbarKeyValueObservingContext
jsq_isObserving
setTranslatesAutoresizingMaskIntoConstraints
sendButtonOnRight
preferredDefaultHeight
44
NSNotFound
JSQMessagesToolbarContentView
toolbarContentView
loadToolbarContentView
jsq_pinAllEdgesOfSubview
setNeedsUpdateConstraints
_contentView
jsq_addObservers
contentView
leftBarButtonItem
rightBarButtonItem
toggleSendButtonEnabled
bundleForClass
loadNibNamed
NSStringFromClass
owner
jsq_removeObservers
messagesInputToolbar
Input
toolbar
hasText
Key
observing
keyPath
ofObject
NSDictionary
isEqualToString
removeTarget
NULL
UIControlEventTouchUpInside
forKeyPath
_jsq_isObserving
NSException
__unused
Function
DeleteObjectNameFunction
Creates
Additionally
inserts
entries
ul
Headers
X_OG_OBJECT_NAME
X_OG_CONTAINER_SUFFIX
storing
SVProgressAnimatedView
CAShapeLayer
ringAnimatedLayer
newSuperview
layoutAnimatedLayer
_ringAnimatedLayer
removeFromSuperlayer
CALayer
layer
addSublayer
widthDiff
heightDiff
CGPointMake
arcCenter
strokeThickness
UIBezierPath
smoothedPath
M_PI_2
UIScreen
mainScreen
clearColor
strokeColor
lineWidth
setFrame
CGRectEqualToRect
superview
_radius
_strokeThickness
strokeEnd
Enabling
integrity
checks
modelName
Looking
demoId
findOne
422
save
observe
ctx
definition
relation
mirroring
definitions
MirroringException
NoMirrorDefinedError
eption
MirrorInactiveError
block_device_mounter_utils
FakeBlockDeviceMounterUtils
wwn
rescanForCleanUp
UnmountDeviceFlowStub
unmountDeviceFlowMutex
unmountDeviceFlowArgsForCall
unmountDeviceFlowReturnsOnCall
UnmountDeviceFlow
BlockDeviceMounterUtils
makes
backup
stamp
SOURCE
ubuntu
workspace
DEST
archive
BACKUP_FILE
cp
listed
s3
ResponseBodyConsumer
Charsets
ImmutableMap
dom
Document
BufferedReader
InputStreamReader
Consumer
UTF_8
getElementsByTagName
uploadId
X_OG_MULTIPART_UPLOAD_ID
S3MultipartWriteResponseBodyConsumer
Init
jsq_correctedAvatarSizeFromSize
jsq_correctedLabelHeightForHeight
Utilities
hash
AuthenticatedRequest
getContent
getContentLength
single_stream_sequential
benchmark
CMD
async_batch_multi_user
FB
getLoginStatus
statusChangeCallback
fbLogin
getElementById
fbLogout
inline
authResponse
logged
contextRoot
contextPath
otc_api_broker_secret
cloudant_url
CLOUDANT_URL
cloudant_password
cloudant_username
CLOUDANT_DATABASE
About
PARTITIONS
INPUT
DIRECTORY
SORT
FILES
OUTPUT
MODE
ADDRESS
LABEL
SORT_INPUT_DIR
SORT_OUTPUT_DIR
Spark
IBM_ARL_teraSort
scala
arl
terasort_2
Exiting
requestedCount
skippedCount
finishedCount
NSTimeInterval
maxConcurrentDownloads
ount
Prevent
very
concurrency
checkArgument
Body
responseHeaders
builder
HttpUtil
VALID_STATUS_CODES
copyOf
publ
ic
newLinkedHashMap
withHeader
withBody
nmon_
webpages
pyNmonAnalyzer
defaultConfig
configfile
killall
move
brother
nmon_150911_2225
node9
234
119_150911_2225
pgrep
StrictHostKeyChecking
scp
nmonchart
report_node
cvzf
average
spread
Distributions
uniform
lognormal
Distribution
validation
distribution
getAverage
nextSample
DecisionsView
CognitiveConcierge
questionLabel
IBAction
keepChattingButtonPressed
NotificationCenter
rawValue
seeRestaurantsButtonPressed
fr
canonical
canonicalize
short
Allows
storyboard
IBInspectable
cornerRadius
newValue
masksToBounds
min
borderColor
cgColor
borderWidth
fadeIn
animate
withDuration
animations
alpha
OPEN_WHISK_BIN
LINK
O
apihost
OPEN_WHISK_KEY
Configurations
travis
ci
installing
jq
apt
triggers
finish
kafka
executing
CONSUME_OUTPUT
KAFKA_MESSAGE
consumed
Found
expecting
Uninstalling
uninstall
LogmetConsumer
Export
Logmet
tenant
bearerToken
Elasticsearch
queryDSLBody
corresponds
prototype
Project
Id
doc_type
chunk
Received
startsWith
5050
syncinteractive
UserQueryStream
UserQueryStream_
MetadataObjectNameFunction
scbe
ScbeRestClient
Login
CreateVolume
volName
serviceName
ScbeVolumeInfo
GetVolumes
DeleteVolume
ScbeResponseMapping
UnmapVolume
ServiceExist
scbeRestClient
connectionInfo
ConnectionInfo
SimpleRestClient
flocker
UrlScbeResourceService
mappings
gb
conInfo
simpleClient
SCBE
Flocker
CredentialInfo
referrer
baseUrl
NewSimpleRestClient
GetLogger
Trace
Errors
ErrorRet
different
Marshal
Post
vols
volumeList
MapVolume
getHostIdByVol
VolumeId
HostId
mappingsResponse
unmap
ScbeStorageService
ser
scsi_identifier
hostList
vol
BUF_LENGTH
InfiniteInputStream
thi
IndexOutOfBoundsException
readBuffer
hostURL
UserDefaults
standard
WebAPIConstantKeys
openWhiskToken
defaultLongitude
defaultLatitude
shouldUseDefaultLocation
WebAPIError
authToken
withJSONObject
httpMethod
allHTTPHeaderFields
httpBody
Data
allowFragments
httpResponse
HTTPURLResponse
hex
customPaleGrayColor
convenience
green
blue
hexString
hexValue
characters
255
nullValue
OperationConfig
GsonBuilder
OperationConfigTypeAdapterFactory
typeAdapterFactory
registerTypeAdapterFactory
weight
fromJson
45
serialization
toJson
Samples
Autocomplete
AutocompleteWithTextFieldController
UITextFieldDelegate
GMSAutocompleteTableDataSourceDelegate
UITextField
_searchField
_resultsController
GMSAutocompleteTableDataSource
_tableDataSource
demoTitle
autocomplete
nav
Lifecycle
field
CGRectZero
keyboardType
guide
addConstraints
NSDictionaryOfVariableBindings
NSLayoutAttributeTop
topLayoutGuide
NSLayoutAttributeBottom
addResultViewBelow
tableDataSource
GMSPlace
resignFirstResponder
autocompleteDidSelectPlace
didFailAutocompleteWithError
autocompleteDidFail
sharedApplication
networkActivityIndicatorVisible
reloadData
textField
constraintsWithVisualFormat
resultView
Force
layoutIfNeeded
Animate
animateWithDuration
Dismiss
textFieldShouldReturn
Private
initializes
tagsArray
tagIndex
photoTags
photosArray
ProfileHeaderView
shots
numberOfShots
profilePictureURL
shotsString
defines
pressed
Polymer
FakeScbeDataModel
CreateVolumeTableStub
createVolumeTableMutex
createVolumeTableArgsForCall
createVolumeTableReturns
createVolumeTableReturnsOnCall
DeleteVolumeStub
deleteVolumeMutex
deleteVolumeArgsForCall
deleteVolumeReturns
deleteVolumeReturnsOnCall
InsertVolumeStub
volumeName
attachTo
fstype
insertVolumeMutex
insertVolumeArgsForCall
insertVolumeReturnsOnCall
GetVolumeStub
ScbeVolume
getVolumeMutex
getVolumeArgsForCall
getVolumeReturns
result3
getVolumeReturnsOnCall
ListVolumesStub
listVolumesMutex
listVolumesArgsForCall
listVolumesReturns
listVolumesReturnsOnCall
UpdateVolumeAttachToStub
scbeVolume
host2attach
updateVolumeAttachToMutex
updateVolumeAttachToArgsForCall
updateVolumeAttachToReturnsOnCall
CreateVolumeTable
fa
ke
CreateVolumeTableReturns
DeleteVolumeCallCount
DeleteVolumeReturns
InsertVolume
InsertVolumeCallCount
InsertVolumeArgsForCall
GetVolume
GetVolumeCallCount
ListVolumes
ListVolumesCallCount
UpdateVolumeAttachToCallCount
UpdateVolumeAttachToReturns
Cat
pip
python
py
ChoiceConfigTypeAdapterFactory
choice
getType
MyConfig
nfig
applies
what
100L
strftime
2011
environments
eval
localizedStrftime
words
days
Monday
Tuesday
Wednesday
Thursday
months
January
April
May
July
AM
PM
_strftime
structure
really
formats
supported
B
getMonth
fall
D
getDate
getHours
I
Math
floor
getFullYear
Default
Defaults
ListenableFuture
weights
responsible
routed
appropriately
As
much
possible
knowledge
act
get_service_url
get_apic_credentials
ResourceDoesNotExistException
APIException
AuthenticationException
UnprocessableEntityException
Retailer
get_retailers
Loopback
Retailers
lw
erp
control
threw
retrieving
internal_details
status_code
retailer_id
get_retailer_inventory
inventory
inventories
catID
henryURL
henry
checkHenry
Henry
201
addition
Oops
grey
lost
holding
never
Camera
signal
interrupted
detected_callback
audio
watson
speech
detector
terminate
listen_for_speech
argv
Ctrl
loop
Listening
